Revit 2022 API
AnalyticalModelColumn.TopExtensionMethod Property
 The top extension method option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public AnalyticalAlignmentMethod TopExtensionMethod { get; set; }
Visual Basic
Public Property TopExtensionMethod As AnalyticalAlignmentMethod
	Get
	Set
Visual C++
public:
property AnalyticalAlignmentMethod TopExtensionMethod {
	AnalyticalAlignmentMethod get ();
	void set (AnalyticalAlignmentMethod value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelColumn Class
Autodesk.Revit.DB.Structure Namespace